app/controllers/articles_controller.rb

    data = JSON.parse(response_body)

    data["articles"].each do |item|
      Article.create(
        country: query["country"],
        category: query["category"],
        source: item["source"]["name"],
        author: item["author"],
        title: item["title"],
        description: item["description"],
        summary: item["content"],
        link: item["url"],
        media: item["urlToImage"],
        publication: item["publishedAt"],
        user: current_user

      )
---
INSERT INTO "articles" ("source", "author", "title", "description", "summary", "link", "media", "country", "language", "topic", "tw_account", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)