app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("country", "category", "source", "author", "title", "description", "summary", "link", "media", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "url" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["url", "https://www.google.com"], ["updated_at", "2022-08-29 17:15:09.861607"], ["id", 1]]