app/controllers/user_controller.rb

INSERT INTO "users" ("mail", "password", "name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["mail", nil], ["password", "[FILTERED]"], ["name", nil], ["surname", nil], ["created_at", "2022-08-31 10:36:16.469125"], ["updated_at", "2022-08-31 10:36:16.469125"]]
---
  def create
    @user = User.new(user_params)

     @user.save