app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("mail", "password", "name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["mail", "a"], ["password", "[FILTERED]"], ["name", "a"], ["surname", "a"], ["created_at", "2022-09-05 14:38:15.399194"], ["updated_at", "2022-09-05 14:38:15.399194"]]