app/models/article.rb

INSERT INTO "articles" ("source", "author", "title", "description", "summary", "link", "media", "country", "language", "topic", "tw_account", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    data = JSON.parse(response.read_body)

    data["articles"].each do |item|
        Article.create(
            source: item["clean_url"],
            author: item["author"],
            title: item["title"],
            description: item["excerpt"],
            summary: item["summary"],
            link: item["link"],
            media: item["media"],
            country: item["country"],
            language: item["language"],
            topic: item["topic"],
            tw_account: item["twitter_account"],
            publication: item["published_date"]
        )