app/models/user.rb

INSERT INTO "users" ("email", "name", "surname", "full_name", "encrypted_password", "reset_password_token", "avatar_url", "provider", "uid", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def self.from_omniauth(access_token)
    puts access_token.info
    where(email: access_token.info.email).first_or_create do |user|