app/models/user.rb

INSERT INTO "users" ("surname", "created_at", "updated_at", "email", "encrypted_password", "name", "reset_password_token", "reset_password_sent_at", "uid", "avatar_url", "provider", "full_name", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "stefano.mazziottaa@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        def self.from_omniauth(access_token)
          puts access_token.info
          where(email: access_token.info.email).first_or_create do |user|
            user.email= access_token.info.email
            user.name = access_token.info.first_name